require 'spec_helper'
baidu_bid = AgaBid::BaiduBidJobGenerate.new
keywords = [
'南京金陵饭店',
'南京金鹰珠江壹号国际酒店',
'南京金鹰珠江壹号国际酒店',
'南京曙光国际大酒店',
'南京侨鸿皇冠假日酒店',
'南京侨鸿皇冠假日酒店',
'南京新纪元大酒店',
'杭州新延安饭店',
'杭州新延安饭店',
'杭州西湖金座大酒店',
'杭州西湖金座大酒店',
'浙江维多利亚丽嘉酒店',
'人民大会堂宾馆北京',
'北京康福瑞假日酒店',
'北京康福瑞假日酒店',
'北京亚奥国际酒店',
'北京亚奥国际酒店',
'北京亚奥国际酒店',
'北京中裕世纪大酒店',
'北京中裕世纪大酒店',
'北京中裕世纪大酒店',
'北京国宾酒店',
'上海中福大酒店',
'上海中福大酒店',
'上海华美国际酒店',
'上海中福世福汇大酒店',
'上海中福世福汇大酒店',
'上海嘉汇华美达广场大酒店',
'广州白云宾馆',
'广州白云宾馆',
'广州白云宾馆',
'广州克莱顿酒店',
'广州克莱顿酒店',
'广州花园酒店',
'广州建国酒店',
'广州东逸湾酒店',
'广州东逸湾酒店',
'深圳皇轩酒店',
'深圳东海朗廷酒店',
'深圳富临大酒店',
'深圳楚天大酒店',
'深圳楚天大酒店',
'深圳鹏威酒店',
'深圳鹏威酒店'
]
keywords.each do |keyword|
	begin
		baidu_bid.baidu_jiudian_generate(keyword,10,1)
	rescue Exception => ex
		puts ex
		next
	end
end
